import galois
import numpy as np

# Створюємо поле Галуа
GF = galois.GF(11)

# 2. Нехай у нас є два лінійних відображення, задані матрицями A та B у цьому полі
# Матриця першого відображення f (розмір 2х2)
A = GF([
    [2, 3],
    [1, 5]
])

# Матриця другого відображення g (розмір 2х2)
B = GF([
    [4, 1],
    [0, 6]
])

# Вхідний вектор x
x = GF([7, 2])

# СПОСІБ 1: Послідовне застосування (пряма суперпозиція f(g(x))) 
y = B @ x       # Застосовуємо g
result_step = A @ y # Застосовуємо f до результату

# СПОСІБ 2: Множення матриць (еквівалент суперпозиції A * B) 
# Матриця загального (суперпоційного) відображення (f * g)
C = np.matmul(A,B)
result_matrix = np.matmul(C,x)

# Однакові операції: np.matmul(C,x) ==  C @ x

print("Результат послідовного застосування:", result_step)
print("Результат через матрицю суперпозиції:", result_matrix)
assert np.all(result_step == result_matrix)

